// Task1
// На старте вы получаете массив. Необходимо написать функцию, которая будет возвращать массив удвоенных значений исходного массива.

// input: [1, 2, 3]
// output: [2, 4, 6]
// input: [4, 1, 1, 1, 4]
// output: [8, 2, 2, 2, 8]
// input: [2, 2, 2, 2, 2, 2]
// output: [4, 4, 4, 4, 4, 4]








// let arr = [34.5, 2, 4 ,48];
// let arr1 = [...arr]; 


// console.log(arr.map((arr) => {
//         return arr * 2
//     }));



// -------------------------------------------------------------------------

// Task2
// Напишите функцию, которая будет удалять каждый второй элемент в массиве. Цикл for использовать запрещено!

// input: ['Привет', 'Пока', 'Снова привет']
// output: ['Привет', 'Снова привет']
// input: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
// output: [1, 3, 5, 7, 9]
// input: ['Пока', {'Цвет': 'Синий'}]
// output: ['Пока']





// let arr = [
    
//     // 1, 2, 3, 4, 5, 6, 7, 8, 9, 10

//     'Привет', 'Здраувствуй', 'Пока'


// ];
// arr = arr.filter((_, index) => index % 2 === 0);
// console.log(arr);


















// -------------------------------------------------------------------------

// Task3
// Возьмите массив с числами, а верните массив, в котором отрицательные числа, становятся положительными, а положительные - отрицательными.

// input: [1, 2, 3, 4, 5]
// output: [-1, -2, -3, -4, -5]
// input: [1, -2, 3, -4, 5]
// output: [-1 ,2, -3, 4, -5]
// input: []
// output: []
// input: [0]
// output: [0]



// let arr = [1, 2, 3, 4, 5];


// function mentor(arr) {
//     return arr.map(num => num >= 0 ? -Math.abs(num) : Math.abs(num));
// }


// let bestmentor = mentor(arr);
// console.log(bestmentor); 










// -------------------------------------------------------------------------

// Task4
// Напишите функцию, которая принимает в качестве аргументов 2 параметра: массив и число, а возвращает новый массив с тем кол-вом элементов с начала массива, которое было указано в числе.

// input: [0, 1, 2, 3, 5, 8, 13], 3
// output:  [0, 1, 2], 'Вернула первые три значения'
// input: [0, 1, 2, 3, 5, 8, 13], 5
// output:  [0, 1, 2, 3 , 5]

// let arr = [0, 1, 2, 3, 5, 8, 13]; 

// function give(arr, count) {
//     return arr.slice(0, count);
// };

// let count = 3;
// let newArr = give(arr, count);
// console.log(newArr); 

// -------------------------------------------------------------------------

// Task5
// Вернуть новый массив, состоящий из элементов, кратных их собственному индексу во входном массиве.

// input: [22, -6, 32, 82, 9, 25]
// output: [-6, 32, 25])
// input: [68, -1, 1, -7, 10, 10]
// output: [-1, 10]
// input: [11, -11]
// output [-11]



// function kratnye(arr) {
//     return arr.filter((element, index) => element % index === 0);
// }

// let arr = [22, -6, 32, 82, 9, 25];
// let newArr = kratnye(arr);
// console.log(newArr); 







// -------------------------------------------------------------------------

// Task6
// Напишите функцию, которая принимает на вход массив,
//  и возвращает новый, в котором все элементы типа string заменены на null.
 
// input: [4, 6, 'Ivan', 5, 'Denis '] 
// output: [4, 6, null, 5 , null]


// function choTakMnogoDz(arr) {
//     return arr.map(element => typeof element === 'string' ? null : element);
// }

// let arr = [1, 'apple', 3, 'banana', 'orange', 6];
// let newArr = choTakMnogoDz(arr);
// console.log(newArr);





// -------------------------------------------------------------------------

// Task7
// Напишите функцию, которая принимает на вход массив с именами ,
// и возвращает новый, в котором содержатся имена не длиннее 5 символов. 

// input: ['Евдоким','Ivan', 'Игнат', 'Denis '] 
// output: ['Ivan', 'Игнат', 'Denis '] 
// function Name5Bykva(names) {
//     return names.filter(name => name.length <= 5);
// }

// const names = ['Aiba', 'BekaChort','misha','КУБА братан', 'Евдоким','Sima    '];
// const dota2 = Name5Bykva(names);
// console.log(dota2); 










// -------------------------------------------------------------------------

// Task8
// Напишите функцию, которая принимает на вход массив чисел, 
// и возвращает новый, в котором все элементы возведены в куб, и те числа, 
// которые кратны и трем и пяти одновременно, заменить их на 0. 


// function fltredMas(numbers) {
//     return numbers.map(num => {
//         if (num % 3 === 0 && num % 5 === 0) {
//             return 0;
//         } else {
//             return Math.pow(num, 3);
//         }
//     });
// }

// const numbers = [1, 2, 3, 4, 5];
// const newMas = fltredMas(numbers);
// console.log(newMas);


// // -------------------------------------------------------------------------

// // Task9
// // Напишите функцию, которая принимает на вход массив слов , 
// // и возвращает массив чисел, являющихся длинной слов. 

// // input: ['Термос', 'Ураган', 'Земля', 'Комбо', 'Корень'] 
// // output: [6, 6, 5, 5, 6] 

// function wordBykvas(words) {
//     return words.map(word => word.length);
// }

// const words = ['Термос', 'Ураган', 'Земля', 'Комбо', 'Корень']
// const lengths = wordBykvas(words);
// console.log(lengths);

// // -------------------------------------------------------------------------

// // Task10
// // Напишите функцию, которая принимает массив чисел 
// // и возвращает массив строк по шаблону <div>{number}</div> 

// // input: [1, 2, 3, 4, 5 ] 
// // output: [ <div>1</div>, <div>2</div>, <div>3</div>, <div>4</div>, <div>5</div> ] 
// function slovaNaSlove(numbers) {
//     return numbers.map(number => `<div>${number}</div>`);
// }

// const number = [1, 2, 3, 4, 5];
// const div = slovaNaSlove(number);
// console.log(div);




// // -------------------------------------------------------------------------

// // Task11
// // Напишите функцию, которая принимает массив строк 
// // и возвращает массив строк с четным количеством букв 

// function otfilter(strings) {
//     return strings.filter(str => str.length % 2 === 0);
// }

// const strings = ['ab', 'abc', 'abcd'];
// const shetnye = otfilter(strings);
// console.log(shetnye); 

// // Input: ['ab', 'abc', 'abcd'] 
// // Output: ['ab', 'abcd']